### PANDAS: INTRODUCTION

> It is often said that 80% of data analysis is spent on the data cleaning and preparing data. To get a handle on the problem, this section focuses on a small, but important aspect of data manipulation and cleaning with Pandas.

### Data Structures

**There are two data structures are there in Pandas -**<br>
* **Series -** It is one-dimensional labeled array capable of holding any data type (integer, strings, floating point numbers, Python objects etc.) of data. The axis is collectively referred to as index.

* **Data Frame -** It is a two-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL Table or a Series of objects.

### Series Data Structure:

**pandas.core.series.Series(data, index, dtype, copy)**<br>
* **data -** data takes various forms like ndarray, list, constants, dictionary etc.<br>
* **index -** it is unique and hashable for easy identification.<br>
* **dtype -** it is for data type.<br>
* **copy -** copy data, and its default value is False. It only affects for Series or one dimensional ndarray inputs.

In [1]:
# importing required modules
import pandas as pd
import numpy as np

In [2]:
# creating empty Series
s = pd.Series()
print (s, type(s))

Series([], dtype: float64) <class 'pandas.core.series.Series'>

<ipython-input-2-2a82def5a837>:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

In [9]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data)
print (s)
print (type(s))
print (s[0], s[3])

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
0        apple
1       banana
2       cherry
3    pineapple
dtype: object
<class 'pandas.core.series.Series'>
apple pineapple

In [7]:
arr_data = np.array([100, 300, 200, 600, 500])
s = pd.Series(arr_data, copy = False)
print (arr_data, type(arr_data))
print (s, type(s))
s[0] = 999
arr_data[2] = 888
print (arr_data, type(arr_data))
print (s, type(s))

[100 300 200 600 500] <class 'numpy.ndarray'>
0    100
1    300
2    200
3    600
4    500
dtype: int32 <class 'pandas.core.series.Series'>
[999 300 888 600 500] <class 'numpy.ndarray'>
0    999
1    300
2    888
3    600
4    500
dtype: int32 <class 'pandas.core.series.Series'>

In [8]:
arr_data = np.array([100, 300, 200, 600, 500])
s = pd.Series(arr_data, copy = True)
print (arr_data, type(arr_data))
print (s, type(s))
s[0] = 999
arr_data[2] = 888
print (arr_data, type(arr_data))
print (s, type(s))

[100 300 200 600 500] <class 'numpy.ndarray'>
0    100
1    300
2    200
3    600
4    500
dtype: int32 <class 'pandas.core.series.Series'>
[100 300 888 600 500] <class 'numpy.ndarray'>
0    999
1    300
2    200
3    600
4    500
dtype: int32 <class 'pandas.core.series.Series'>

In [15]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data, index = [100, 101, 102, 103])
print (s)
print (type(s))
print (s[100], type(s[100]), s[103], type(s[103]))

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
100        apple
101       banana
102       cherry
103    pineapple
dtype: object
<class 'pandas.core.series.Series'>
apple <class 'str'> pineapple <class 'str'>

In [20]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data, index = [100, 103, 100, 103])
print (s)
print (type(s))
print (s[100])
print (s[103])
print (type(s[103]))

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
100        apple
103       banana
100       cherry
103    pineapple
dtype: object
<class 'pandas.core.series.Series'>
100     apple
100    cherry
dtype: object
103       banana
103    pineapple
dtype: object
<class 'pandas.core.series.Series'>

In [18]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data, index = ['fruit-1', 'fruit-2', 'fruit-3', 'fruit-4'])
print (s)
print (type(s))
print (s['fruit-1'], s[0])
print (s['fruit-3'], s[2])

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
fruit-1        apple
fruit-2       banana
fruit-3       cherry
fruit-4    pineapple
dtype: object
<class 'pandas.core.series.Series'>
apple apple
cherry cherry

In [22]:
arr_data = np.array(['apple', 'banana', 'cherry', 'pineapple'])
print (arr_data, type(arr_data))
s = pd.Series(data = arr_data, index = ['fruit-1', 'fruit-2', 'fruit-2', 'fruit-1'])
print (s)
print (type(s))
print (s['fruit-1'])
print (s['fruit-2'])
print (s[0])
print (s[2])

['apple' 'banana' 'cherry' 'pineapple'] <class 'numpy.ndarray'>
fruit-1        apple
fruit-2       banana
fruit-2       cherry
fruit-1    pineapple
dtype: object
<class 'pandas.core.series.Series'>
fruit-1        apple
fruit-1    pineapple
dtype: object
fruit-2    banana
fruit-2    cherry
dtype: object
apple
cherry

In [24]:
# create a Series from a dictionary
dict_data = {'apple':100, 'banana':202, 'coconut':450, 'mango':435}
print (dict_data, type(dict_data))
s = pd.Series(dict_data)
print (s)

{'apple': 100, 'banana': 202, 'coconut': 450, 'mango': 435} <class 'dict'>
apple      100
banana     202
coconut    450
mango      435
dtype: int64

In [25]:
dict_data = {'apple':100, 'banana':202, 'coconut':450, 'mango':435}
print (dict_data, type(dict_data))
s = pd.Series(dict_data, index = ['banana', 'mango', 'apple', 'coconut'])
print (s)

{'apple': 100, 'banana': 202, 'coconut': 450, 'mango': 435} <class 'dict'>
banana     202
mango      435
apple      100
coconut    450
dtype: int64

In [31]:
dict_data = {'apple':100, 'banana':202, 'coconut':450, 'mango':435}
print (dict_data, type(dict_data))
s = pd.Series(data = dict_data, index = ['banana', 'lime', 'coconut', 'mango', 'guava', 'apple', 'mango', 'apple', 'coconut'])
print (s)
print (s[0], s[3], s[4], s[5])

{'apple': 100, 'banana': 202, 'coconut': 450, 'mango': 435} <class 'dict'>
banana     202.0
lime         NaN
coconut    450.0
mango      435.0
guava        NaN
apple      100.0
mango      435.0
apple      100.0
coconut    450.0
dtype: float64
202.0 435.0 nan 100.0

In [32]:
# create a Series from a scalar
s = pd.Series(5, index = [0, 1, 2, 3, 4])
print (s)

0    5
1    5
2    5
3    5
4    5
dtype: int64

In [34]:
s = pd.Series(5, index = [0, 1, 2, 0, 1, 2])
print (s)
print (s[0])

0    5
1    5
2    5
0    5
1    5
2    5
dtype: int64
0    5
0    5
dtype: int64

In [40]:
# Create a Series from a list
s = pd.Series(data = [101, 303, 202, 404, 505], index = ['red', 'blue', 'brown', 'black', 'silver'])
print (s)
print (s['blue'], s[1])
# print (s['golden'])   # error - KeyError

red       101
blue      303
brown     202
black     404
silver    505
dtype: int64
303 303

In [43]:
s = pd.Series(data = [101, 303, 202, 404, 505], index = ['red', 'blue', 'brown', 'black', 'silver'])
print (s)
print (s.sort_values())
print (s.sort_index())

red       101
blue      303
brown     202
black     404
silver    505
dtype: int64
red       101
brown     202
blue      303
black     404
silver    505
dtype: int64
black     404
blue      303
brown     202
red       101
silver    505
dtype: int64

In [50]:
s = pd.Series(data = ['red', 'blue', 'brown', 'black', 'silver'])
print (s)
print (s[0])
print (s[3])
print (s[0:4])
print (s[-5:-1])

0       red
1      blue
2     brown
3     black
4    silver
dtype: object
red
black
0      red
1     blue
2    brown
3    black
dtype: object
0      red
1     blue
2    brown
3    black
dtype: object

In [53]:
s = pd.Series(data = [101, 303, 202, 404, 505], index = ['red', 'blue', 'brown', 'black', 'silver'])
print (s)
print (s['brown'])
print (s[['brown', 'red', 'silver', 'blue']])

red       101
blue      303
brown     202
black     404
silver    505
dtype: int64
202
brown     202
red       101
silver    505
blue      303
dtype: int64

In [60]:
var1 = 100
var2 = 200
var1
var2

200

In [61]:
var1 = 100
var2 = 200
print (var1)
var2

100

200

In [62]:
var1 = 100
var2 = 200
print (var1)
print (var2)

100
200

### Data Frame Data Structure:

### Create DataFrame

In [63]:
user_data = [['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']]
print (user_data, type(user_data))
user_columns = ['name', 'age', 'gender', 'job']
print (user_columns, type(user_columns))
user1 = pd.DataFrame(data = user_data)
print (user1)
user1

[['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']] <class 'list'>
['name', 'age', 'gender', 'job'] <class 'list'>
       0   1  2        3
0  alice  19  F  student
1   john  26  M  student

       0   1  2        3
0  alice  19  F  student
1   john  26  M  student

In [64]:
user_data = [['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']]
print (user_data, type(user_data))
user_columns = ['name', 'age', 'gender', 'job']
print (user_columns, type(user_columns))
user1 = pd.DataFrame(data = user_data, columns = user_columns)
print (user1)
user1

[['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']] <class 'list'>
['name', 'age', 'gender', 'job'] <class 'list'>
    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [67]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'],
             'emp_age':[34, 35, 45, 43]}
emp_id = [100, 101, 102, 103]
print (data_dict)
df = pd.DataFrame(data = data_dict)
df

{'emp_name': ['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age': [34, 35, 45, 43]}

  emp_name  emp_age
0     Amal       34
1    Kamal       35
2    Bimal       45
3  Shyamal       43

In [68]:
data_dict = {'emp_name':['Amal', 'Kamal', 'Bimal', 'Shyamal'],
         'emp_age':[34, 35, 45, 43]}
emp_id = [100, 101, 102, 103]
print (data_dict)
df = pd.DataFrame(data = data_dict, index = emp_id)
df

{'emp_name': ['Amal', 'Kamal', 'Bimal', 'Shyamal'], 'emp_age': [34, 35, 45, 43]}

    emp_name  emp_age
100     Amal       34
101    Kamal       35
102    Bimal       45
103  Shyamal       43

In [70]:
df = df.reset_index()
df

   index emp_name  emp_age
0    100     Amal       34
1    101    Kamal       35
2    102    Bimal       45
3    103  Shyamal       43

In [71]:
df.rename(columns = {'index':'emp_id', 'emp_name':'emp_fname'})

   emp_id emp_fname  emp_age
0     100      Amal       34
1     101     Kamal       35
2     102     Bimal       45
3     103   Shyamal       43

In [72]:
df

   index emp_name  emp_age
0    100     Amal       34
1    101    Kamal       35
2    102    Bimal       45
3    103  Shyamal       43

In [73]:
df.rename(columns = {'index':'emp_id', 'emp_name':'emp_fname'}, inplace = True)
df

   emp_id emp_fname  emp_age
0     100      Amal       34
1     101     Kamal       35
2     102     Bimal       45
3     103   Shyamal       43

In [76]:
# DataFrame to NumPy ndarray
arr_data = df[['emp_fname', 'emp_age']].to_numpy()
print (arr_data, type(arr_data))

[['Amal' 34]
 ['Kamal' 35]
 ['Bimal' 45]
 ['Shyamal' 43]] <class 'numpy.ndarray'>

In [77]:
arr_data = df.to_numpy()
print (arr_data, type(arr_data))

[[100 'Amal' 34]
 [101 'Kamal' 35]
 [102 'Bimal' 45]
 [103 'Shyamal' 43]] <class 'numpy.ndarray'>

In [107]:
user_data = [['alice', 19, 'F', 'student'], ['john', 26, 'M', 'student']]
user_columns = ['name', 'age', 'gender', 'job']
user1 = pd.DataFrame(data = user_data, columns = user_columns)
user1

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student

In [109]:
user_data = dict(name = ['eric', 'paul'], age = [22, 58], gender = ['M', 'F'], job = ['student', 'manager'])
print (user_data)
user2 = pd.DataFrame(data = user_data)
user2

{'name': ['eric', 'paul'], 'age': [22, 58], 'gender': ['M', 'F'], 'job': ['student', 'manager']}

   name  age gender      job
0  eric   22      M  student
1  paul   58      F  manager

In [84]:
user_data = dict(name = ['peter', 'julie'], age = [33, 44], gender = ['M', 'F'], job = ['engineer', 'scientist'])
print (user_data)
user3 = pd.DataFrame(data = user_data)
user3

{'name': ['peter', 'julie'], 'age': [33, 44], 'gender': ['M', 'F'], 'job': ['engineer', 'scientist']}

    name  age gender        job
0  peter   33      M   engineer
1  julie   44      F  scientist

### Concatenate DataFrame

In [93]:
users = user1.append(user2)
users

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
0   eric   22      M  student
1   paul   58      F  manager

In [94]:
users = user1.append(user2, ignore_index = True)
users

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student
3   paul   58      F  manager

In [95]:
users = users.append(user3, ignore_index=True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [98]:
users = user1.append(user2).append(user3, ignore_index = True)
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [99]:
users = pd.concat([user1, user2, user3])
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
0   eric   22      M    student
1   paul   58      F    manager
0  peter   33      M   engineer
1  julie   44      F  scientist

In [110]:
users = pd.concat([user1, user2, user3], ignore_index = True) 
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

### Join DataFrame

In [111]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [113]:
dict_data = dict(name = ['alice', 'john', 'eric', 'julie', 'anderson'],
                 height = [165, 180, 175, 171, 169])
print (dict_data)
user4 = pd.DataFrame(data = dict_data)
user4

{'name': ['alice', 'john', 'eric', 'julie', 'anderson'], 'height': [165, 180, 175, 171, 169]}

       name  height
0     alice     165
1      john     180
2      eric     175
3     julie     171
4  anderson     169

In [115]:
# inner join: All common rows from both data frames
merge_inner = pd.merge(users, user4, on = "name", how = "inner")
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [117]:
merge_inner = pd.merge(users, user4, on = "name")  # by default inner join will take place
merge_inner

    name  age gender        job  height
0  alice   19      F    student     165
1   john   26      M    student     180
2   eric   22      M    student     175
3  julie   44      F  scientist     171

In [119]:
# outer join: All rows from both data frames
merge_outer = pd.merge(users, user4, on = "name", how = "outer")
merge_outer

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

In [120]:
# left outer join: All rows from the left data frame and matching rows from the right data frame
merge_left = pd.merge(users, user4, on = "name", how = "left")
merge_left

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [121]:
# right outer join: Only matching rows from the left data frame and all rows from the right data frame
merge_right = pd.merge(users, user4, on = "name", how = "right")
merge_right

       name   age gender        job  height
0     alice  19.0      F    student     165
1      john  26.0      M    student     180
2      eric  22.0      M    student     175
3     julie  44.0      F  scientist     171
4  anderson   NaN    NaN        NaN     169

### Summarizing

In [122]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [123]:
print (type(users))

<class 'pandas.core.frame.DataFrame'>

In [124]:
users.head()

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
3   paul   58      F   manager
4  peter   33      M  engineer

In [125]:
users.tail()

    name  age gender        job
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [126]:
users.head(3)

    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [127]:
users.tail(3)

    name  age gender        job
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [132]:
users.any()

name      True
age       True
gender    True
job       True
dtype: bool

In [144]:
users.sample()

   name  age gender      job
2  eric   22      M  student

In [148]:
users.sample(3)

    name  age gender       job
2   eric   22      M   student
4  peter   33      M  engineer
3   paul   58      F   manager

In [155]:
print (users.index)
print (users.columns)
print (users.dtypes)
print (type(users.dtypes))

RangeIndex(start=0, stop=6, step=1)
Index(['name', 'age', 'gender', 'job'], dtype='object')
name      object
age        int64
gender    object
job       object
dtype: object
<class 'pandas.core.series.Series'>

In [166]:
print (users.shape)
print (f"So the Row# = {users.shape[0]} and Col# = {users.shape[1]}")
print (users.values)
print (type(users.values), users.values.ndim, users.values.shape, users.values.size)

(6, 4)
So the Row# = 6 and Col# = 4
[['alice' 19 'F' 'student']
 ['john' 26 'M' 'student']
 ['eric' 22 'M' 'student']
 ['paul' 58 'F' 'manager']
 ['peter' 33 'M' 'engineer']
 ['julie' 44 'F' 'scientist']]
<class 'numpy.ndarray'> 2 (6, 4) 24

In [169]:
print (users.job.value_counts())
print (users.gender.value_counts())

student      3
manager      1
scientist    1
engineer     1
Name: job, dtype: int64
F    3
M    3
Name: gender, dtype: int64

In [173]:
users.describe()

             age
count   6.000000
mean   33.666667
std    14.895189
min    19.000000
25%    23.000000
50%    29.500000
75%    41.250000
max    58.000000

In [175]:
users.describe(include=['object'])

        name gender      job
count      6      6        6
unique     6      2        4
top     john      F  student
freq       1      3        3

In [176]:
users.describe(include = 'all')

        name        age gender      job
count      6   6.000000      6        6
unique     6        NaN      2        4
top     john        NaN      F  student
freq       1        NaN      3        3
mean     NaN  33.666667    NaN      NaN
std      NaN  14.895189    NaN      NaN
min      NaN  19.000000    NaN      NaN
25%      NaN  23.000000    NaN      NaN
50%      NaN  29.500000    NaN      NaN
75%      NaN  41.250000    NaN      NaN
max      NaN  58.000000    NaN      NaN

In [177]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

### Column Selection

In [178]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [179]:
users.job

0      student
1      student
2      student
3      manager
4     engineer
5    scientist
Name: job, dtype: object

In [180]:
users['job']

0      student
1      student
2      student
3      manager
4     engineer
5    scientist
Name: job, dtype: object

In [182]:
users[['job', 'age']]

         job  age
0    student   19
1    student   26
2    student   22
3    manager   58
4   engineer   33
5  scientist   44

In [184]:
my_cols = ['age', 'job']
users[my_cols]

   age        job
0   19    student
1   26    student
2   22    student
3   58    manager
4   33   engineer
5   44  scientist

### Row Selection

In [185]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [189]:
print (df.iloc[3])
print (type(df.iloc[3]))
print ()
print (df.loc[3])
print (type(df.loc[3]))

name         paul
age            58
gender          F
job       manager
Name: 3, dtype: object
<class 'pandas.core.series.Series'>

name         paul
age            58
gender          F
job       manager
Name: 3, dtype: object
<class 'pandas.core.series.Series'>

In [190]:
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [201]:
print (df.iloc[4][3], df.iloc[4]['job'], df.loc[4][3], df.loc[4]['job'])
print (df.iloc[4, 3], df.iloc[4]['job'], df.loc[4][3], df.loc[4, 'job'])
print (df.shape, len(df), df.ndim, df.size)

engineer engineer engineer engineer
engineer engineer engineer engineer
(6, 4) 6 2 24

In [203]:
print (merge_outer.shape, len(merge_outer), merge_outer.ndim, merge_outer.size)
merge_outer

(7, 5) 7 2 35

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

In [212]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [213]:
for i in range(df.shape[0]):
    current_row = df.iloc[i]
    current_row.age += 100
    df.iloc[i] = current_row
    
df

C:\Users\Arnab\anaconda3\lib\site-packages\pandas\core\generic.py:5494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

    name  age gender        job
0  alice  119      F    student
1   john  126      M    student
2   eric  122      M    student
3   paul  158      F    manager
4  peter  133      M   engineer
5  julie  144      F  scientist

### Row Selection and Filtering

In [217]:
users.age < 40

0     True
1     True
2     True
3    False
4     True
5    False
Name: age, dtype: bool

In [218]:
users[users.age < 40]

    name  age gender       job
0  alice   19      F   student
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

In [219]:
users[users.age < 40].job

0     student
1     student
2     student
4    engineer
Name: job, dtype: object

In [222]:
users[users.age < 40]['job']

0     student
1     student
2     student
4    engineer
Name: job, dtype: object

In [221]:
users[users.age < 40][['job', 'name']]

        job   name
0   student  alice
1   student   john
2   student   eric
4  engineer  peter

In [224]:
(users.age > 30) & (users.gender == 'F')

0    False
1    False
2    False
3     True
4    False
5     True
dtype: bool

In [225]:
users[(users.age > 30) & (users.gender == 'F')]

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist

In [227]:
users[(users.age > 30) & (users.gender == 'F')][['name', 'job', 'gender']]

    name        job gender
3   paul    manager      F
5  julie  scientist      F

In [229]:
users[(users.age > 30) | (users.gender == 'F')][['name', 'job', 'gender', 'age']]

    name        job gender  age
0  alice    student      F   19
3   paul    manager      F   58
4  peter   engineer      M   33
5  julie  scientist      F   44

In [230]:
users[(users.job == "engineer") | (users.job == 'student')][['name', 'job', 'gender', 'age']]

    name       job gender  age
0  alice   student      F   19
1   john   student      M   26
2   eric   student      M   22
4  peter  engineer      M   33

In [232]:
users[users.job.isin(["engineer", 'student'])][['name', 'job', 'gender', 'age']]

    name       job gender  age
0  alice   student      F   19
1   john   student      M   26
2   eric   student      M   22
4  peter  engineer      M   33

### Sorting

In [234]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [237]:
df.age.sort_values()

0    19
2    22
1    26
4    33
5    44
3    58
Name: age, dtype: int64

In [238]:
df.sort_values(by = 'age')

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
1   john   26      M    student
4  peter   33      M   engineer
5  julie   44      F  scientist
3   paul   58      F    manager

In [244]:
df = users.copy()
df = df.sort_values(by = 'age', ascending = False)
df

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
4  peter   33      M   engineer
1   john   26      M    student
2   eric   22      M    student
0  alice   19      F    student

In [245]:
df = users.copy()
df.sort_values(by = 'age', ascending = False, inplace = True)
df

    name  age gender        job
3   paul   58      F    manager
5  julie   44      F  scientist
4  peter   33      M   engineer
1   john   26      M    student
2   eric   22      M    student
0  alice   19      F    student

In [248]:
df = users.copy()
df.sort_values(by = ['job', 'age'], inplace = True)
df.index = range(0, df.shape[0])
df

    name  age gender        job
0  peter   33      M   engineer
1   paul   58      F    manager
2  julie   44      F  scientist
3  alice   19      F    student
4   eric   22      M    student
5   john   26      M    student

### Unpivoting and Pivoting

**Unpivot ->**  Wide format (Unstacked Format) to Long format (Stacked Format)<br>
**Pivot ->**    Long format (Stacked Format) to Wide format (Unstacked Format)

In [249]:
users

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [250]:
# performing the unpivot operation: Wide format to Long format
stacked = pd.melt(users, id_vars = "name", var_name = "variable", value_name = "value")
stacked

     name variable      value
0   alice      age         19
1    john      age         26
2    eric      age         22
3    paul      age         58
4   peter      age         33
5   julie      age         44
6   alice   gender          F
7    john   gender          M
8    eric   gender          M
9    paul   gender          F
10  peter   gender          M
11  julie   gender          F
12  alice      job    student
13   john      job    student
14   eric      job    student
15   paul      job    manager
16  peter      job   engineer
17  julie      job  scientist

In [254]:
unstacked = stacked.pivot(index = 'name', columns = "variable", values = "value")
unstacked

variable age gender        job
name
alice     19      F    student
eric      22      M    student
john      26      M    student
julie     44      F  scientist
paul      58      F    manager
peter     33      M   engineer

In [255]:
unstacked.reset_index(inplace = True)
unstacked.columns.name = ""
unstacked

    name age gender        job
0  alice  19      F    student
1   eric  22      M    student
2   john  26      M    student
3  julie  44      F  scientist
4   paul  58      F    manager
5  peter  33      M   engineer

### Quality Control: Duplicate Data

In [263]:
df = users.copy()
df = df.append(df.iloc[0])
df = df.append(df.iloc[2])
df = df.append(df.iloc[4])
df = df.append(df.iloc[3], ignore_index=True)
df.sort_values(by = "name", inplace=True)
df.index = range(0, df.shape[0])
df

    name  age gender        job
0  alice   19      F    student
1  alice   19      F    student
2   eric   22      M    student
3   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
7   paul   58      F    manager
8  peter   33      M   engineer
9  peter   33      M   engineer

In [272]:
print (df.duplicated().sum())
df.duplicated()

4

0    False
1     True
2    False
3     True
4    False
5    False
6    False
7     True
8    False
9     True
dtype: bool

In [275]:
print ((~df.duplicated()).sum())
~df.duplicated()

6

0     True
1    False
2     True
3    False
4     True
5     True
6     True
7    False
8     True
9    False
dtype: bool

In [265]:
df[df.duplicated()]

    name  age gender       job
1  alice   19      F   student
3   eric   22      M   student
7   paul   58      F   manager
9  peter   33      M  engineer

In [267]:
df[~df.duplicated()]

    name  age gender        job
0  alice   19      F    student
2   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
8  peter   33      M   engineer

In [270]:
df.job.duplicated()

0    False
1     True
2     True
3     True
4     True
5    False
6    False
7     True
8    False
9     True
Name: job, dtype: bool

In [271]:
df[df.job.duplicated()]

    name  age gender       job
1  alice   19      F   student
2   eric   22      M   student
3   eric   22      M   student
4   john   26      M   student
7   paul   58      F   manager
9  peter   33      M  engineer

In [278]:
print (df.duplicated(['job', 'gender']).sum())
df.duplicated(['job', 'gender'])

5

0    False
1     True
2    False
3     True
4     True
5    False
6    False
7     True
8    False
9     True
dtype: bool

In [279]:
df

    name  age gender        job
0  alice   19      F    student
1  alice   19      F    student
2   eric   22      M    student
3   eric   22      M    student
4   john   26      M    student
5  julie   44      F  scientist
6   paul   58      F    manager
7   paul   58      F    manager
8  peter   33      M   engineer
9  peter   33      M   engineer

In [281]:
df.drop_duplicates(inplace = True)
df.index = range(0, df.shape[0])
df

    name  age gender        job
0  alice   19      F    student
1   eric   22      M    student
2   john   26      M    student
3  julie   44      F  scientist
4   paul   58      F    manager
5  peter   33      M   engineer

### Quality Control: Missing Data

In [284]:
df = merge_left.copy()
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
3   paul   58      F    manager     NaN
4  peter   33      M   engineer     NaN
5  julie   44      F  scientist   171.0

In [285]:
df.describe(include='all')

        name        age gender      job      height
count      6   6.000000      6        6    4.000000
unique     6        NaN      2        4         NaN
top     john        NaN      F  student         NaN
freq       1        NaN      3        3         NaN
mean     NaN  33.666667    NaN      NaN  172.750000
std      NaN  14.895189    NaN      NaN    6.344289
min      NaN  19.000000    NaN      NaN  165.000000
25%      NaN  23.000000    NaN      NaN  169.500000
50%      NaN  29.500000    NaN      NaN  173.000000
75%      NaN  41.250000    NaN      NaN  176.250000
max      NaN  58.000000    NaN      NaN  180.000000

In [286]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     6 non-null      int64
 2   gender  6 non-null      object
 3   job     6 non-null      object
 4   height  4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 288.0+ bytes

In [291]:
print (df.height.isnull().sum())
print (df.height.isnull())
df[df.height.isnull()]

2
0    False
1    False
2    False
3     True
4     True
5    False
Name: height, dtype: bool

    name  age gender       job  height
3   paul   58      F   manager     NaN
4  peter   33      M  engineer     NaN

In [292]:
print (df.height.notnull().sum())
print (df.height.notnull())
df[df.height.notnull()]

4
0     True
1     True
2     True
3    False
4    False
5     True
Name: height, dtype: bool

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   171.0

In [293]:
df.isnull()

    name    age  gender    job  height
0  False  False   False  False   False
1  False  False   False  False   False
2  False  False   False  False   False
3  False  False   False  False    True
4  False  False   False  False    True
5  False  False   False  False   False

In [294]:
df.notnull()

   name   age  gender   job  height
0  True  True    True  True    True
1  True  True    True  True    True
2  True  True    True  True    True
3  True  True    True  True   False
4  True  True    True  True   False
5  True  True    True  True    True

In [297]:
# Strategy - 1: (Deleting rows containing missing values)
df.dropna(inplace=True)
df

    name  age gender        job  height
0  alice   19      F    student   165.0
1   john   26      M    student   180.0
2   eric   22      M    student   175.0
5  julie   44      F  scientist   171.0

In [300]:
df = merge_outer.copy()
df.dropna(how = "all", inplace = True)
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

In [301]:
# Strategy - 2: (Filling up missing values)
df = merge_outer.copy()
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     NaN
4     peter  33.0      M   engineer     NaN
5     julie  44.0      F  scientist   171.0
6  anderson   NaN    NaN        NaN   169.0

In [304]:
df = merge_outer.copy()
df.fillna(0, inplace=True)
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      john  26.0      M    student   180.0
2      eric  22.0      M    student   175.0
3      paul  58.0      F    manager     0.0
4     peter  33.0      M   engineer     0.0
5     julie  44.0      F  scientist   171.0
6  anderson   0.0      0          0   169.0

In [308]:
df = merge_outer.copy()
mean_height = df.height.mean()
print (mean_height)
df.fillna(mean_height, inplace=True)
df

172.0

       name    age gender        job  height
0     alice   19.0      F    student   165.0
1      john   26.0      M    student   180.0
2      eric   22.0      M    student   175.0
3      paul   58.0      F    manager   172.0
4     peter   33.0      M   engineer   172.0
5     julie   44.0      F  scientist   171.0
6  anderson  172.0  172.0      172.0   169.0

In [311]:
df = merge_outer.copy()
df.sort_values(by='age', inplace=True)
df.index = range(0, df.shape[0])
df.fillna(method = 'pad', inplace=True)
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer   180.0
4     julie  44.0      F  scientist   171.0
5      paul  58.0      F    manager   171.0
6  anderson  58.0      F    manager   169.0

In [312]:
df = merge_outer.copy()
df.sort_values(by='age', inplace=True)
df.index = range(0, df.shape[0])
df.fillna(method = 'bfill', inplace=True)
df

       name   age gender        job  height
0     alice  19.0      F    student   165.0
1      eric  22.0      M    student   175.0
2      john  26.0      M    student   180.0
3     peter  33.0      M   engineer   171.0
4     julie  44.0      F  scientist   171.0
5      paul  58.0      F    manager   169.0
6  anderson   NaN    NaN        NaN   169.0

### Rename Column Names

In [313]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [314]:
new_column_names = ["new_name", "new_age", "new_gender", "new_job"]
df.columns = new_column_names
df

  new_name  new_age new_gender    new_job
0    alice       19          F    student
1     john       26          M    student
2     eric       22          M    student
3     paul       58          F    manager
4    peter       33          M   engineer
5    julie       44          F  scientist

In [315]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [318]:
df.rename(columns = {"name":"new_name", "age":"current_age"}, inplace=True)
df

  new_name  current_age gender        job
0    alice           19      F    student
1     john           26      M    student
2     eric           22      M    student
3     paul           58      F    manager
4    peter           33      M   engineer
5    julie           44      F  scientist

### Groupby on DataFrame

In [319]:
df = users.copy()
df

    name  age gender        job
0  alice   19      F    student
1   john   26      M    student
2   eric   22      M    student
3   paul   58      F    manager
4  peter   33      M   engineer
5  julie   44      F  scientist

In [321]:
for group, data_frame in users.groupby("job"):
    print (type(group), type(data_frame))
    print ("Group name:", group)
    print (data_frame)

<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: engineer
    name  age gender       job
4  peter   33      M  engineer
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: manager
   name  age gender      job
3  paul   58      F  manager
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: scientist
    name  age gender        job
5  julie   44      F  scientist
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: student
    name  age gender      job
0  alice   19      F  student
1   john   26      M  student
2   eric   22      M  student

In [322]:
for group, data_frame in users.groupby("gender"):
    print (type(group), type(data_frame))
    print ("Group name:", group)
    print (data_frame)

<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: F
    name  age gender        job
0  alice   19      F    student
3   paul   58      F    manager
5  julie   44      F  scientist
<class 'str'> <class 'pandas.core.frame.DataFrame'>
Group name: M
    name  age gender       job
1   john   26      M   student
2   eric   22      M   student
4  peter   33      M  engineer

### Reading Data on DataFrame from External Sources

In [329]:
try:
    print ("Reading data from the .CSV file...")
    # df = pd.read_csv("./salary_table.csv")
    # df = pd.read_csv("salary_table.csv")
    # df = pd.read_csv("C:\\Users\Arnab\Accenture Feb 2023\salary_table.csv")
    # df = pd.read_csv("C:\\Users\\Arnab\\Accenture Feb 2023\\salary_table.csv")
    # df = pd.read_csv("C://Users//Arnab//Accenture Feb 2023//salary_table.csv")
    df = pd.read_csv("C:/Users/Arnab/Accenture Feb 2023/salary_table.csv")
    print ("Data has been read successfully...")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.head()

Reading data from the .CSV file...
Data has been read successfully...

   salary  experience education management
0   13876           1  Bachelor          Y
1   11608           1      Ph.D          N
2   18701           1      Ph.D          Y
3   11283           1    Master          N
4   11767           1      Ph.D          N

In [338]:
try:
    print ("Reading data from the .XLSX file...")
    # df = pd.read_excel("./Online Retail.xlsx")
    # df = pd.read_excel("Online Retail.xlsx")
    # df = pd.read_excel("C:\\Users\Arnab\Accenture Feb 2023\Online Retail.xlsx")
    # df = pd.read_excel("C:\\Users\\Arnab\\Accenture Feb 2023\\Online Retail.xlsx")
    # df = pd.read_excel("C://Users//Arnab//Accenture Feb 2023//Online Retail.xlsx")
    df = pd.read_excel("C:/Users/Arnab/Accenture Feb 2023/Online Retail.xlsx")
    print ("Data has been read successfully...")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.head()

Reading data from the .XLSX file...
Data has been read successfully...

,INVOICENO,STOCKCODE,DESCRIPTION,QUANTITY,INVOICEDATE,UNITPRICE,CUSTOMERID,COUNTRY
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom

In [339]:
try:
    print ("Reading data from the .XLSX file...")
    df = pd.read_excel("C:/Users/Arnab/Accenture Feb 2023/Online Retail.xlsx", sheet_name="Sheet1")
    print ("Data has been read successfully...")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.head()

Reading data from the .XLSX file...
Data has been read successfully...

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom

In [340]:
try:
    print ("Reading data from the .XLSX file...")
    df = pd.read_excel("C:/Users/Arnab/Accenture Feb 2023/Online Retail.xlsx", sheet_name="Sheet2")
    print ("Data has been read successfully...")
except:
    print ("File access error !!!")
    print ("Data file could not be read successfully...")
    
df.head()

Reading data from the .XLSX file...
Data has been read successfully...

,INVOICENO,STOCKCODE,DESCRIPTION,QUANTITY,INVOICEDATE,UNITPRICE,CUSTOMERID,COUNTRY
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom